# OpenAndActivateDocument Method (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ApplicationEntryPoint..::..OpenAndActivateDocument Method
ApplicationEntryPoint Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| OpenAndActivateDocument(String) | Opens and activates a Revit document.  (Inherited from UIApplication.) |
| OpenAndActivateDocument(ModelPath, OpenOptions, Boolean) | Opens and activates a Revit document, include both local document or cloud document.  (Inherited from UIApplication.) |
| OpenAndActivateDocument(ModelPath, OpenOptions, Boolean, IOpenFromCloudCallback) | Opens and activates a Revit document, include both local document or cloud document.  (Inherited from UIApplication.) |

# See Also
ApplicationEntryPoint Class
ApplicationEntryPoint Members
Autodesk.Revit.UI.Macros Namespace